In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/미세먼지_PM10__월별_도시별_대기오염도_20231116153601.csv',encoding='ansi')

In [3]:
df.head(3)

,구분,항목,단위,2010.01 월,2010.02 월,2010.03 월,2010.04 월,2010.05 월,2010.06 월,2010.07 월,...,2022.06 월,2022.07 월,2022.08 월,2022.09 월,2022.10 월,2022.11 월,2022.12 월,2023.01 월,2023.02 월,Unnamed: 161
0,총계,월평균,NaN,57.0,49,64.0,51,59,52,36,...,22,22,19,22,26,39,35,45.0,43.0,NaN
1,서울특별시,월평균,NaN,59.0,50,61.0,49,56,51,33,...,22,25,20,22,25,39,38,48.0,46.0,NaN
2,부산광역시,월평균,NaN,47.0,44,64.0,50,56,46,41,...,19,20,19,20,21,33,30,37.0,34.0,NaN

In [4]:
long_df = df.melt(id_vars=['구분', '항목','단위'], 
                  var_name='STD_YYYYMM', 
                  value_name='PM10')

In [8]:
long_df.head(3)

    SIDO   항목  단위 STD_YYYYMM  PM10
0     총계  월평균 NaN  2010.01 월  57.0
1  서울특별시  월평균 NaN  2010.01 월  59.0
2  부산광역시  월평균 NaN  2010.01 월  47.0

In [6]:
long_df.rename(columns={'구분': 'SIDO'}, inplace=True)

In [9]:
# 대체하고자 하는 도시 이름 목록
cities = [
    "수원", "안양", "성남", "의정부", "광명", "안산", "평택", "과천", "구리", "의왕",
    "고양", "광주", "군포", "시흥", "부천", "남양주", "용인", "김포", "오산", "하남",
    "화성", "양주", "동두천", "안성", "이천", "파주", "포천", "여주", "연천", "가평", "양평"
]

# '구분' 열에서 해당 도시 이름들을 '경기도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '경기도')

In [10]:
cities = [
    "양구", "고성", "정선", "횡성", "춘천", "강릉", "원주", "동해", "삼척", "평창", 
    "양양", "속초", "영월", "철원", "홍천", "화천", "태백", "인제"
]

# '구분' 열에서 해당 도시 이름들을 '강원도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '강원도')

In [11]:
# 대체하고자 하는 충청북도 도시 이름 목록
cities = [
    "괴산", "음성", "청주", "충주", "제천", "청원", "단양", "진천", "옥천", "영동", "증평", "보은"
]

# '구분' 열에서 해당 도시 이름들을 '충청북도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '충청북도')

In [12]:
# 대체하고자 하는 충청남도 도시 이름 목록
cities = [
    "천안", "당진", "서산", "아산", "논산", "태안", "보령", "홍성", "공주", 
    "부여", "청양", "금산", "예산", "계룡", "서천"
]

# '구분' 열에서 해당 도시 이름들을 '충청남도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '충청남도')

In [13]:
# 대체하고자 하는 전라북도 도시 이름 목록
cities = [
    "임실", "전주", "군산", "익산", "남원", "정읍", "고창", "부안", "김제", 
    "완주", "진안", "무주", "순창", "장수"
]

# '구분' 열에서 해당 도시 이름들을 '전라북도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '전라북도')

In [15]:
# 대체하고자 하는 전라남도 도시 이름 목록
cities = [
    "화순", "여수", "광양", "순천", "목포", "영암", "나주", "담양", "장성", "해남", 
    "영광", "장흥", "진도", "완도", "함평", "고흥", "신안", "무안", "강진", "곡성", "구례", "보성"
]

# 'SIDO' 열에서 해당 도시 이름들을 '전라남도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '전라남도')

In [18]:
# 대체하고자 하는 경상북도 도시 이름 목록
cities = [
    "영덕", "영천", "의성", "울릉도", "포항", "구미", "김천", "경주", "안동", "영주", 
    "경산", "상주", "칠곡", "울진", "봉화", "고령", "군위", "성주", "예천", "청도", 
    "청송", "영양", "문경"
]

# 'SIDO' 열에서 해당 도시 이름들을 '경상북도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '경상북도')

In [20]:
# 대체하고자 하는 경상남도 도시 이름 목록
cities = [
    "창원", "마산", "진주", "진해", "하동", "김해", "양산", "거제", "사천", "밀양", 
    "통영", "강원도", "거창", "함안", "함양", "남해", "산청", "의령", "창녕", "합천"
]

# 'SIDO' 열에서 해당 도시 이름들을 '경상남도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '경상남도')

In [22]:
# 대체하고자 하는 경상남도 도시 이름 목록
cities = [
    "제주", "서귀포"
]

# 'SIDO' 열에서 해당 도시 이름들을 '제주특별자치도'로 변경
long_df['SIDO'] = long_df['SIDO'].replace(cities, '제주특별자치도')

In [27]:
long_df['PM10'].dtype

dtype('float64')

In [26]:
long_df['PM10'] = pd.to_numeric(long_df['PM10'], errors='coerce') 

# 오브젝트 타입에서의 변환

In [28]:
# SIDO, STD_YYYYMM 열을 기준으로 그룹바이 한후 PM10의 평균값을 새로운 콜롬에 저장
long_df['AVG_PM10'] = long_df.groupby(['SIDO', 'STD_YYYYMM'])['PM10'].transform('mean')

In [30]:
# 평균값을 소수점 둘째자리까지 반올림
long_df['AVG_PM10'] = long_df['AVG_PM10'].round(2)

In [32]:
long_df.to_csv('data/test/pm10.csv',index=False)

In [33]:
df2 = long_df.drop_duplicates(subset=['SIDO', 'STD_YYYYMM', 'AVG_PM10'])
# SIDO와 STD_YYYYMM 열을 기준으로 중복을 제거
# 중복된 데이터를 제거하면 데이터가 정렬됨

In [37]:
# SIDO 열에 총계 또는 도평균을 포함하는 열을 필터링 
df2 = df2[~df2['SIDO'].str.contains('총계|도평균')]

In [39]:
# PM10 , 항목 , 단위 콜롬 제거
df2 = df2.drop(columns=['PM10', '항목', '단위'])

In [44]:
# 'STD_YYYYMM' 열의 숫자가 아닌 문자를 제거
df2['STD_YYYYMM'] = df2['STD_YYYYMM'].str.replace('[^\d]', '', regex=True)

In [46]:
# 결과를 정수 타입으로 변환
df2['STD_YYYYMM'] = df2['STD_YYYYMM'].astype(int)

In [47]:
df2['STD_YYYYMM'].dtype

dtype('int32')

In [48]:
df2.to_csv('data/test/pm10_2.csv', index=False)

In [2]:
df2 = pd.read_csv('data/test/pm10_2.csv')

In [3]:
df2.head()

    SIDO  STD_YYYYMM  AVG_PM10
0  서울특별시      201001      59.0
1  부산광역시      201001      47.0
2  대구광역시      201001      56.0
3  인천광역시      201001      64.0
4  광주광역시      201001      46.0

In [4]:
df2.tail()

         SIDO  STD_YYYYMM  AVG_PM10
2539     충청남도         161       NaN
2540     전라북도         161       NaN
2541     전라남도         161       NaN
2542     경상북도         161       NaN
2543  제주특별자치도         161       NaN

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('data/test/pm10_2.csv')
df.head()

    SIDO  STD_YYYYMM  AVG_PM10
0  서울특별시      201001      59.0
1  부산광역시      201001      47.0
2  대구광역시      201001      56.0
3  인천광역시      201001      64.0
4  광주광역시      201001      46.0

In [10]:
# 'AVG_PM10'의 값이 80 이하이거나 NaN이면 'N', 81 이상이면 'Y'를 'PM2_BAD' 열에 할당
df['PM10_BAD'] = np.where((df['AVG_PM10'] <= 80) | pd.isna(df['AVG_PM10']), 'N', 'Y')

In [11]:
df.head()

    SIDO  STD_YYYYMM  AVG_PM10 PM10_BAD
0  서울특별시      201001      59.0        N
1  부산광역시      201001      47.0        N
2  대구광역시      201001      56.0        N
3  인천광역시      201001      64.0        N
4  광주광역시      201001      46.0        N

In [12]:
df.to_csv('data/test/pm10_2.csv')